{
    "research":[
        {
            "title": "Mutual interactors as a principle for the discovery of phenotypes in molecular networks",
            "authors": "Sabri Eyuboglu*, Marinka Zitnik*,  Jure Leskovec",
            "venue": "preprint",
            "year": 2019,
            "image": "res/mi_preview.png",
            "description": "Biological networks are powerful resources for the discovery of molecular phenotypes. Fun-damental to network analysis is the principle—rooted in social networks—that nodes thatinteract in the network tend to have similar properties.  While this long-standing principleunderlies powerful methods in biology that associate proteins with phenotypes on the basis ofnetwork proximity, interacting proteins are not necessarily similar, and proteins with similarproperties do not necessarily interact.  Here, we show that proteins are more likely to havesimilar phenotypes, not if they directly interact in a molecular network, but if they interactwith the same proteins. We call this the mutual interactor principle and show that it holds forseveral kinds of molecular networks, including protein-protein interaction, genetic interac-tion, and signaling networks. We then develop a machine learning framework for predictingmolecular phenotypes on the basis of mutual interactors. Strikingly, the framework can pre-dict drug targets, disease proteins, and protein functions in different species, and it performsbetter than much more complex algorithms. The framework is robust to incomplete biologi-cal data and capable of generalizing to phenotypes it has not seen during training. Our workrepresents a network-based predictive platform for phenotypic characterization of proteins.",
            "github": "https://github.com/seyuboglu/milieu"
        },
        {
            "title": "Cross-modal weak supervision enables abnormality localization in full-body PET-CT",
            "authors": "Sabri Eyuboglu*, Marinka Zitnik*,  Jure Leskovec",
            "venue": "preprint",
            "year": 2019,
            "image": "res/pet_ct_preview.png",
            "description": "Computational decision support systems could provide clinical value in full-body PET-CT workflows. However, the lack of labeled data and the sheer size of PET-CT studies make it challenging to apply existing supervised machine learning systems to these full-body scans. Leveraging recent advancements in natural language processing, we introduce a weak-supervision framework that extracts imperfect, yet highly granular regional abnormality training labels from the radiologist reports associated with each scan. Using these labels, we train a multi-task 3D convolutional neural network to detect abnormalities in 26 anatomical regions commonly of interest in PET-CT protocols. Our model can detect lymph node, lung and liver abnormalities with median areas under the curve of 87%, 85% and 92%, respectively. We show that performing multi-task pre-training on these core tasks can enable strong performance on rare abnormalities and orthogonal tasks. Multi-task pre-training enables improvements of 28 and 17 AUC percentage-points in detecting abnormalities in the kidney and pancreas, respectively. Moreover, we show that a pre-trained model can learn to predict mortality within 90 days, a critical task for palliative care teams (AUC=79%). Our work introduces a new approach to weak supervision in medical imaging that enables the first deep learning model capable of making anatomically resolved abnormality predictions in full-body PET-CT scans."
        }
    ],
    "teaching":[
        {
            "title": "Computação no Ensino Mmedio",
            "authors": "Sabri Eyuboglu and Geoffrey Angus",
            "year": 2018,
            "image": "res/mi_preview.png",
            "github": "https://github.com/seyuboglu/milieu"
        }
    ]
}