{
    "research":[
        {
            "title": "Mutual interactors as a principle for the discovery of phenotypes in molecular networks",
            "authors": "Sabri Eyuboglu*, Marinka Zitnik*,  Jure Leskovec",
            "venue": "In submission",
            "year": "2019",
            "image": "res/mi_preview.png",
            "description": "Biological networks are powerful resources for the discovery of molecular phenotypes. Here, we show that proteins are more likely to have similar phenotypes, not if they directly interact in a molecular network, but if they interact with the same proteins. We call this the mutual interactor principle and show that it holds for several kinds of molecular networks, including protein-protein interaction, genetic interaction, and signaling networks. We then develop a machine learning framework for predicting molecular phenotypes on the basis of mutual interactors. Strikingly, the framework can predict drug targets, disease proteins, and protein functions in different species, and it performs better than much more complex algorithms. The framework is robust to incomplete biological data and capable of generalizing to phenotypes it has not seen during training.",
            "manuscript": "http://sabrieyuboglu.com/papers/mutual-interactors.pdf",
            "github": "https://github.com/seyuboglu/milieu"
        },
        {
            "title": "Cross-modal weak supervision enables abnormality localization in full-body PET-CT",
            "authors": "Sabri Eyuboglu*, Geoffrey Angus*,  Bhavik Patel, Anuj Pareek, Guido Davidzon, Jared Dunnmon, Matthew Lungren",
            "venue": "In submission",
            "year": "2019",
            "image": "res/pet_ct_preview.png",
            "github": null, 
            "manuscript": "http://sabrieyuboglu.com/papers/pet-ct.pdf",
            "description": "Computational decision support systems could provide clinical value in full-body PET-CT workflows. However, the lack of labeled data and the sheer size of PET-CT studies make it challenging to apply existing supervised machine learning systems to these full-body scans. Leveraging recent advancements in natural language processing, we introduce a weak-supervision framework that extracts imperfect, yet highly granular regional abnormality training labels from the radiologist reports associated with each scan. Using these labels, we train a multi-task 3D convolutional neural network to detect abnormalities in 26 anatomical regions commonly of interest in PET-CT protocols. Our model can detect lymph node, lung and liver abnormalities with median areas under the curve of 87%, 85% and 92%, respectively. We show that performing multi-task pre-training on these core tasks can enable strong performance on rare abnormalities and orthogonal tasks. Multi-task pre-training enables improvements of 28 and 17 AUC percentage-points in detecting abnormalities in the kidney and pancreas, respectively."
        }
    ],
    "teaching":[
        {
            "title": "Computação no Ensino Medio",
            "organization": "Sabri Eyuboglu and Geoffrey Angus",
            "year": "2018",
            "school": "Colégio SESC São Jose – Curitiba, Brasil",
            "image": "res/cem_preview.png",
            "description": " I spent the summer of 2018 in Curitiba, Brazil teaching an introductory computer science course to over 300 awesome high schoolers from all over the city. Every week Geoff Angus (another master's student at Stanford) and I co-taught eleven different classes at three different high schools in the city. We designed a full curriculum from scratch that uses the pedagogical methods of CS106A, but is tailored for high-school students that speak English as a second language. We wrote all of the assignments, course notes and slides from scratch. You can find all these materials on our website. We worked with school administrators and math teachers at the high schools to ensure the continuation of CS curriculum at the high school after we left. Also, because many students spoke little english, we lectured primarily in Portuguese (I had spent the school year before that summer studying Portuguese in preparation",
            "github": "https://github.com/geoffreyangus/cs106r",
            "website": "http://cs106r.com/"
        },
        {
            "title": "CS 198 Section Leader",
            "organization": "Computer Science Department",
            "year": "2015-2018",
            "school": "Stanford University",
            "image": "res/cem_preview.png",
            "description": "From sophomore to senior year of undergrad, I was a CS 106A/B section leader at Stanford. I taught a weekly class of twelve students, graded assignments and held office hours.",
            "github": "https://github.com/geoffreyangus/cs106r",
            "website": "http://web.stanford.edu/class/cs106b/"
        },
        {
            "title": "CS Bridge Section Leader",
            "organization": "Computer Science Department",
            "year": "2019",
            "school": "Koç University – Istanbul, Turkey",
            "image": "res/cem_preview.png",
            "description": "I spent two weeks this past summer in Istanbul teaching computer science at Koç University. I helped develop some of the curriculum and materials for the course.",
            "github": "https://github.com/geoffreyangus/cs106r",
            "website": "https://koc.csbridge.org/en/index.html"
        }
    ],
    "projects":[
        {
            "title": "On the Categorization of Linguistic Bias",
            "authors": "Sabri Eyuboglu*, Richard Diehl*",
            "venue": "WeCNLP",
            "year": "2019",
            "image": null,
            "description": "We present a supervised learning method for exer- cise recognition and transcription. Our algorithm ingests micro- electromagnetic (MEM) sequences recorded by a wearable device during a workout set and outputs both the type of exercise performed and the number of repetitions completed. Our model consists of a 1-D convolutional layer whose output is fed into a Bidirectional Long Short-Term Memory Recurrent Neural Net- work (BLSTM). Because exercise transcription is a many-to-many sequence prediction problem where input and output sequences are unaligned and different in length, we use Connectionist Temporal Classification (CTC) Loss to train the network. Our model generalizes to new users not included in the training set and achieves near-perfect accuracy in transcribing their workouts.",
            "manuscript": "https://raw.githubusercontent.com/seyuboglu/sabri-site/master/data/repkit/manuscript.pdf",
            "poster": "https://raw.githubusercontent.com/seyuboglu/sabri-site/master/data/repkit/poster.pdf",
            "github": null 
        },
        {
            "title": "Criteria of Fairness in Envy-Free Rent-Splitting ",
            "authors": "Sabri Eyuboglu, Kye GaHyun Kim, KiJung Park",
            "venue": "CS 269I",
            "year": "2018",
            "image": "res/mi_preview.png",
            "description": "We propose using a new notion of fairness, the consensus criterion, when designing computational rent-splitting algorithms. I formalize this notion of fairness mathematically as an optimization problem solvable with linear programming. I prove that theoretically it achieves desirable properties including envy-freeness and show empirically that people find its output significantly fairer than existing computational methods of rent-splitting.",
            "manuscript": "https://raw.githubusercontent.com/seyuboglu/sabri-site/master/data/rent_splitting/manuscript.pdf",
            "github": "https://github.com/seyuboglu/free-the-envy"
        },
        {
            "title": "Exercise Transcription with CTC Loss",
            "authors": "Sabri Eyuboglu, Geoffrey Angus, Roozbeh Mahdavian, Pierce Freeman",
            "venue": "CS 230",
            "year": "2018",
            "image": null,
            "description": "We present a supervised learning method for exercise recognition and transcription. Our algorithm ingests micro- electromagnetic (MEM) sequences recorded by a wearable device during a workout set and outputs both the type of exercise performed and the number of repetitions completed. Our model consists of a 1-D convolutional layer whose output is fed into a Bidirectional Long Short-Term Memory Recurrent Neural Net- work (BLSTM). Because exercise transcription is a many-to-many sequence prediction problem where input and output sequences are unaligned and different in length, we use Connectionist Temporal Classification (CTC) Loss to train the network. Our model generalizes to new users not included in the training set and achieves near-perfect accuracy in transcribing their workouts.",
            "manuscript": "https://raw.githubusercontent.com/seyuboglu/sabri-site/master/data/repkit/manuscript.pdf",
            "poster": "https://raw.githubusercontent.com/seyuboglu/sabri-site/master/data/repkit/poster.pdf",
            "github": null 
        }

    ]
}